
# 과제 ----------------------------------------------------------------------


n <- 40 #표본 
phat <- 0.25 #표본비율 
alpha <- 0.05
pzero <- 0.2
  
# pvalue

z_alpha <- qnorm(1 - alpha) #/2???
z_alpha

# 검정통계량
z <- (phat - pzero) / sqrt(pzero*(1 - pzero)/n)
z

# 유의수준 0.05에서 안됨 

pvalue <- pnorm(-z) # 0.2145977
pvalue <- pnorm(z) #  0.7854023
pvalue
1 - pvalue
pnorm(z_alpha)

print(c(z ,z_alpha, pvalue))

# 0.7905694 1.9599640 0.7854023
# 0.7905694 1.6448536 0.7854023
# 유의수준 0.05에서 모비율에 대한 검정을 했을 때, H0을 기각할 수 x
# 0.7905694 >= 1.9599640 을 만족시키지 못하기 때문
# p값에 의해,신뢰구간 70% ? 유의수준 70% ?
